{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "USER_NAME = 'broil-grandioso-pie_bot'\n",
    "PWD = 'NrBl_CRF6101Dg'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "logs/log (10-08_23:43:39).txt\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "print('%s/log (%s).txt'%('logs', time.strftime(\"%m-%d_%H:%M:%S\", time.localtime())))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Login successful. Session token: XFX7V_Ujf9aZmYZx8cwS3C2sYRaGLE-Q\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'XFX7V_Ujf9aZmYZx8cwS3C2sYRaGLE-Q'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from speakeasypy import Speakeasy\n",
    "import rdflib\n",
    "\n",
    "# login agent\n",
    "speakeasy = Speakeasy(host='https://speakeasy.ifi.uzh.ch', username=USER_NAME, password=PWD)\n",
    "speakeasy.login() \n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "file = open('test.txt', 'w')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import logging\n",
    "import time\n",
    "logging.basicConfig(filename='%s.log'%time.strftime(\"%m-%d_%H_%M_%S\", time.localtime()),\n",
    "                    filemode='w', \n",
    "                    format='%(asctime)s - %(levelname)s - %(message)s',\n",
    "                    datefmt=\"%d-%M-%Y %H:%M:%S\", \n",
    "                    level=logging.INFO)\n",
    "logging.info('test')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nce001fe36f654867a19bae1ab12d4190 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# initialize KG\n",
    "graph = rdflib.Graph()\n",
    "graph.parse('graph/14_graph.nt', format='turtle')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   PREFIX ddis: <http://ddis.ch/atai/>     PREFIX wd: <http://www.wikidata.org/entity/>     PREFIX wdt: <http://www.wikidata.org/prop/direct/>     PREFIX schema: <http://schema.org/>         SELECT ?lbl WHERE {        ?movie wdt:P31 wd:Q11424 .        ?movie ddis:rating ?rating .        ?movie rdfs:label ?lbl .    }    ORDER BY ASC(?rating)     LIMIT 1       \n",
      "PREFIX ddis: <http://ddis.ch/atai/>     PREFIX wd: <http://www.wikidata.org/entity/>     PREFIX wdt: <http://www.wikidata.org/prop/direct/>     PREFIX schema: <http://schema.org/>         SELECT ?director WHERE {        ?movie rdfs:label \"Apocalypse Now\"@en .            ?movie wdt:P57 ?directorItem .       ?directorItem rdfs:label ?director .   }    LIMIT 1\n",
      "     PREFIX ddis: <http://ddis.ch/atai/>      PREFIX wd: <http://www.wikidata.org/entity/>      PREFIX wdt: <http://www.wikidata.org/prop/direct/>      PREFIX schema: <http://schema.org/>           SELECT ?lbl WHERE {         SELECT ?movie ?lbl ?rating WHERE {             ?movie wdt:P31 wd:Q11424 .             ?movie ddis:rating ?rating .             ?movie rdfs:label ?lbl .         }         ORDER BY DESC(?rating)          LIMIT 20     }     \n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "--- Logging error ---\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 127, in post_messages\n",
      "    response = self.chat_api.post_api_room_with_roomid(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 771, in __call__\n",
      "    return self.callable(self, *args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api\\chat_api.py\", line 350, in __post_api_room_with_roomid\n",
      "    return self.call_with_http_info(**kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 833, in call_with_http_info\n",
      "    return self.api_client.call_api(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 408, in call_api\n",
      "    return self.__call_api(resource_path, method,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 195, in __call_api\n",
      "    response_data = self.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 454, in request\n",
      "    return self.rest_client.POST(url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 266, in POST\n",
      "    return self.request(\"POST\", url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 183, in request\n",
      "    r = self.pool_manager.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 81, in request\n",
      "    return self.request_encode_body(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 173, in request_encode_body\n",
      "    return self.urlopen(method, url, **extra_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\poolmanager.py\", line 376, in urlopen\n",
      "    response = conn.urlopen(method, u.request_uri, **kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 714, in urlopen\n",
      "    httplib_response = self._make_request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 415, in _make_request\n",
      "    conn.request(method, url, **httplib_request_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connection.py\", line 244, in request\n",
      "    super(HTTPConnection, self).request(method, url, body=body, headers=headers)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1255, in request\n",
      "    self._send_request(method, url, body, headers, encode_chunked)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1300, in _send_request\n",
      "    body = _encode(body, 'body')\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 164, in _encode\n",
      "    raise UnicodeEncodeError(\n",
      "UnicodeEncodeError: 'latin-1' codec can't encode character '\\u2013' in position 1107: Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\n",
      "\n",
      "During handling of the above exception, another exception occurred:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 1081, in emit\n",
      "    msg = self.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 925, in format\n",
      "    return fmt.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 664, in format\n",
      "    record.message = record.getMessage()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 369, in getMessage\n",
      "    msg = msg % self.args\n",
      "TypeError: not all arguments converted during string formatting\n",
      "Call stack:\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 194, in _run_module_as_main\n",
      "    return _run_code(code, main_globals, None,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 87, in _run_code\n",
      "    exec(code, run_globals)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel_launcher.py\", line 17, in <module>\n",
      "    app.launch_new_instance()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\traitlets\\config\\application.py\", line 1053, in launch_instance\n",
      "    app.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelapp.py\", line 736, in start\n",
      "    self.io_loop.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\tornado\\platform\\asyncio.py\", line 215, in start\n",
      "    self.asyncio_loop.run_forever()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 570, in run_forever\n",
      "    self._run_once()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 1859, in _run_once\n",
      "    handle._run()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\events.py\", line 81, in _run\n",
      "    self._context.run(self._callback, *self._args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 516, in dispatch_queue\n",
      "    await self.process_one()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 505, in process_one\n",
      "    await dispatch(*args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 412, in dispatch_shell\n",
      "    await result\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 740, in execute_request\n",
      "    reply_content = await reply_content\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\ipkernel.py\", line 422, in do_execute\n",
      "    res = shell.run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\zmqshell.py\", line 546, in run_cell\n",
      "    return super().run_cell(*args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3006, in run_cell\n",
      "    result = self._run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3061, in _run_cell\n",
      "    result = runner(coro)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\async_helpers.py\", line 129, in _pseudo_sync_runner\n",
      "    coro.send(None)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3266, in run_cell_async\n",
      "    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3445, in run_ast_nodes\n",
      "    if await self.run_code(code, result, async_=asy):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3505, in run_code\n",
      "    exec(code_obj, self.user_global_ns, self.user_ns)\n",
      "  File \"C:\\Users\\TTTeq\\AppData\\Local\\Temp\\ipykernel_18276\\203685242.py\", line 18, in <module>\n",
      "    room.post_messages(f\"{ans}\")\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 132, in post_messages\n",
      "    logging.error(f\"An error occurred while posting the message to room {self.room_id}:\", e)\n",
      "Message: 'An error occurred while posting the message to room d4de3512-3eb5-48c0-a8f7-64c713151105:'\n",
      "Arguments: (UnicodeEncodeError('latin-1', \"[(rdflib.term.Literal('Forrest Gump', lang='en'),), (rdflib.term.Literal('The Lord of the Rings: The Fellowship of the Ring', lang='en'),), (rdflib.term.Literal('Heart of a Dog', lang='en'),), (rdflib.term.Literal('Kannathil Muthamittal', lang='en'),), (rdflib.term.Literal('Once Upon a Time in America', lang='en'),), (rdflib.term.Literal('Oldboy', lang='en'),), (rdflib.term.Literal('The Great Dictator', lang='en'),), (rdflib.term.Literal('Apocalypse Now', lang='en'),), (rdflib.term.Literal('The Shining', lang='en'),), (rdflib.term.Literal('The Cranes Are Flying', lang='en'),), (rdflib.term.Literal('Shwaas', lang='en'),), (rdflib.term.Literal('Khosla Ka Ghosla', lang='en'),), (rdflib.term.Literal('Inglourious Basterds', lang='en'),), (rdflib.term.Literal('Good Will Hunting', lang='en'),), (rdflib.term.Literal('Full Metal Jacket', lang='en'),), (rdflib.term.Literal('The Ascent', lang='en'),), (rdflib.term.Literal('War and Peace', lang='en'),), (rdflib.term.Literal('2001: A Space Odyssey', lang='en'),), (rdflib.term.Literal('Scarface', lang='en'),), (rdflib.term.Literal('Star Wars: Episode VI – Return of the Jedi', lang='en'),)]\", 1107, 1108, \"Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\"),)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "     PREFIX ddis: <http://ddis.ch/atai/>      PREFIX wd: <http://www.wikidata.org/entity/>      PREFIX wdt: <http://www.wikidata.org/prop/direct/>      PREFIX schema: <http://schema.org/>           SELECT ?lbl WHERE {         SELECT ?movie ?lbl ?rating WHERE {             ?movie wdt:P31 wd:Q11424 .             ?movie ddis:rating ?rating .             ?movie rdfs:label ?lbl .         }         ORDER BY DESC(?rating)          LIMIT 1    }     \n",
      "     PREFIX ddis: <http://ddis.ch/atai/>      PREFIX wd: <http://www.wikidata.org/entity/>      PREFIX wdt: <http://www.wikidata.org/prop/direct/>      PREFIX schema: <http://schema.org/>           SELECT ?lbl WHERE {         SELECT ?movie ?lbl ?rating WHERE {             ?movie wdt:P31 wd:Q11424 .             ?movie ddis:rating ?rating .             ?movie rdfs:label ?lbl .         }         ORDER BY DESC(?rating)          LIMIT 2     }     \n",
      "     PREFIX ddis: <http://ddis.ch/atai/>      PREFIX wd: <http://www.wikidata.org/entity/>      PREFIX wdt: <http://www.wikidata.org/prop/direct/>      PREFIX schema: <http://schema.org/>           SELECT ?lbl WHERE {         SELECT ?movie ?lbl ?rating WHERE {             ?movie wdt:P31 wd:Q11424 .             ?movie ddis:rating ?rating .             ?movie rdfs:label ?lbl .         }         ORDER BY DESC(?rating)          LIMIT 20     }     \n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "--- Logging error ---\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 127, in post_messages\n",
      "    response = self.chat_api.post_api_room_with_roomid(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 771, in __call__\n",
      "    return self.callable(self, *args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api\\chat_api.py\", line 350, in __post_api_room_with_roomid\n",
      "    return self.call_with_http_info(**kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 833, in call_with_http_info\n",
      "    return self.api_client.call_api(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 408, in call_api\n",
      "    return self.__call_api(resource_path, method,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 195, in __call_api\n",
      "    response_data = self.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 454, in request\n",
      "    return self.rest_client.POST(url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 266, in POST\n",
      "    return self.request(\"POST\", url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 183, in request\n",
      "    r = self.pool_manager.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 81, in request\n",
      "    return self.request_encode_body(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 173, in request_encode_body\n",
      "    return self.urlopen(method, url, **extra_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\poolmanager.py\", line 376, in urlopen\n",
      "    response = conn.urlopen(method, u.request_uri, **kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 714, in urlopen\n",
      "    httplib_response = self._make_request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 415, in _make_request\n",
      "    conn.request(method, url, **httplib_request_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connection.py\", line 244, in request\n",
      "    super(HTTPConnection, self).request(method, url, body=body, headers=headers)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1255, in request\n",
      "    self._send_request(method, url, body, headers, encode_chunked)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1300, in _send_request\n",
      "    body = _encode(body, 'body')\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 164, in _encode\n",
      "    raise UnicodeEncodeError(\n",
      "UnicodeEncodeError: 'latin-1' codec can't encode character '\\u2013' in position 1107: Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\n",
      "\n",
      "During handling of the above exception, another exception occurred:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 1081, in emit\n",
      "    msg = self.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 925, in format\n",
      "    return fmt.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 664, in format\n",
      "    record.message = record.getMessage()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 369, in getMessage\n",
      "    msg = msg % self.args\n",
      "TypeError: not all arguments converted during string formatting\n",
      "Call stack:\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 194, in _run_module_as_main\n",
      "    return _run_code(code, main_globals, None,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 87, in _run_code\n",
      "    exec(code, run_globals)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel_launcher.py\", line 17, in <module>\n",
      "    app.launch_new_instance()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\traitlets\\config\\application.py\", line 1053, in launch_instance\n",
      "    app.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelapp.py\", line 736, in start\n",
      "    self.io_loop.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\tornado\\platform\\asyncio.py\", line 215, in start\n",
      "    self.asyncio_loop.run_forever()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 570, in run_forever\n",
      "    self._run_once()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 1859, in _run_once\n",
      "    handle._run()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\events.py\", line 81, in _run\n",
      "    self._context.run(self._callback, *self._args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 516, in dispatch_queue\n",
      "    await self.process_one()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 505, in process_one\n",
      "    await dispatch(*args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 412, in dispatch_shell\n",
      "    await result\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 740, in execute_request\n",
      "    reply_content = await reply_content\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\ipkernel.py\", line 422, in do_execute\n",
      "    res = shell.run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\zmqshell.py\", line 546, in run_cell\n",
      "    return super().run_cell(*args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3006, in run_cell\n",
      "    result = self._run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3061, in _run_cell\n",
      "    result = runner(coro)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\async_helpers.py\", line 129, in _pseudo_sync_runner\n",
      "    coro.send(None)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3266, in run_cell_async\n",
      "    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3445, in run_ast_nodes\n",
      "    if await self.run_code(code, result, async_=asy):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3505, in run_code\n",
      "    exec(code_obj, self.user_global_ns, self.user_ns)\n",
      "  File \"C:\\Users\\TTTeq\\AppData\\Local\\Temp\\ipykernel_18276\\203685242.py\", line 18, in <module>\n",
      "    room.post_messages(f\"{ans}\")\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 132, in post_messages\n",
      "    logging.error(f\"An error occurred while posting the message to room {self.room_id}:\", e)\n",
      "Message: 'An error occurred while posting the message to room d4de3512-3eb5-48c0-a8f7-64c713151105:'\n",
      "Arguments: (UnicodeEncodeError('latin-1', \"[(rdflib.term.Literal('Forrest Gump', lang='en'),), (rdflib.term.Literal('The Lord of the Rings: The Fellowship of the Ring', lang='en'),), (rdflib.term.Literal('Heart of a Dog', lang='en'),), (rdflib.term.Literal('Kannathil Muthamittal', lang='en'),), (rdflib.term.Literal('Once Upon a Time in America', lang='en'),), (rdflib.term.Literal('Oldboy', lang='en'),), (rdflib.term.Literal('The Great Dictator', lang='en'),), (rdflib.term.Literal('Apocalypse Now', lang='en'),), (rdflib.term.Literal('The Shining', lang='en'),), (rdflib.term.Literal('The Cranes Are Flying', lang='en'),), (rdflib.term.Literal('Shwaas', lang='en'),), (rdflib.term.Literal('Khosla Ka Ghosla', lang='en'),), (rdflib.term.Literal('Inglourious Basterds', lang='en'),), (rdflib.term.Literal('Good Will Hunting', lang='en'),), (rdflib.term.Literal('Full Metal Jacket', lang='en'),), (rdflib.term.Literal('The Ascent', lang='en'),), (rdflib.term.Literal('War and Peace', lang='en'),), (rdflib.term.Literal('2001: A Space Odyssey', lang='en'),), (rdflib.term.Literal('Scarface', lang='en'),), (rdflib.term.Literal('Star Wars: Episode VI – Return of the Jedi', lang='en'),)]\", 1107, 1108, \"Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\"),)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "PREFIX ddis: <http://ddis.ch/atai/>      PREFIX wd: <http://www.wikidata.org/entity/>      PREFIX wdt: <http://www.wikidata.org/prop/direct/>      PREFIX schema: <http://schema.org/>           SELECT ?lbl WHERE {         SELECT ?movie ?lbl ?rating WHERE {             ?movie wdt:P31 wd:Q11424 .             ?movie ddis:rating ?rating .             ?movie rdfs:label ?lbl .         }         ORDER BY ASC(?rating)          LIMIT 10     }\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "--- Logging error ---\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 127, in post_messages\n",
      "    response = self.chat_api.post_api_room_with_roomid(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 771, in __call__\n",
      "    return self.callable(self, *args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api\\chat_api.py\", line 350, in __post_api_room_with_roomid\n",
      "    return self.call_with_http_info(**kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 833, in call_with_http_info\n",
      "    return self.api_client.call_api(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 408, in call_api\n",
      "    return self.__call_api(resource_path, method,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 195, in __call_api\n",
      "    response_data = self.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\api_client.py\", line 454, in request\n",
      "    return self.rest_client.POST(url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 266, in POST\n",
      "    return self.request(\"POST\", url,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\openapi\\client\\rest.py\", line 183, in request\n",
      "    r = self.pool_manager.request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 81, in request\n",
      "    return self.request_encode_body(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\request.py\", line 173, in request_encode_body\n",
      "    return self.urlopen(method, url, **extra_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\poolmanager.py\", line 376, in urlopen\n",
      "    response = conn.urlopen(method, u.request_uri, **kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 714, in urlopen\n",
      "    httplib_response = self._make_request(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connectionpool.py\", line 415, in _make_request\n",
      "    conn.request(method, url, **httplib_request_kw)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\urllib3-1.26.17-py3.8.egg\\urllib3\\connection.py\", line 244, in request\n",
      "    super(HTTPConnection, self).request(method, url, body=body, headers=headers)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1255, in request\n",
      "    self._send_request(method, url, body, headers, encode_chunked)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 1300, in _send_request\n",
      "    body = _encode(body, 'body')\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\http\\client.py\", line 164, in _encode\n",
      "    raise UnicodeEncodeError(\n",
      "UnicodeEncodeError: 'latin-1' codec can't encode character '\\u2013' in position 195: Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\n",
      "\n",
      "During handling of the above exception, another exception occurred:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 1081, in emit\n",
      "    msg = self.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 925, in format\n",
      "    return fmt.format(record)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 664, in format\n",
      "    record.message = record.getMessage()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\logging\\__init__.py\", line 369, in getMessage\n",
      "    msg = msg % self.args\n",
      "TypeError: not all arguments converted during string formatting\n",
      "Call stack:\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 194, in _run_module_as_main\n",
      "    return _run_code(code, main_globals, None,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\runpy.py\", line 87, in _run_code\n",
      "    exec(code, run_globals)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel_launcher.py\", line 17, in <module>\n",
      "    app.launch_new_instance()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\traitlets\\config\\application.py\", line 1053, in launch_instance\n",
      "    app.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelapp.py\", line 736, in start\n",
      "    self.io_loop.start()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\tornado\\platform\\asyncio.py\", line 215, in start\n",
      "    self.asyncio_loop.run_forever()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 570, in run_forever\n",
      "    self._run_once()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\base_events.py\", line 1859, in _run_once\n",
      "    handle._run()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\asyncio\\events.py\", line 81, in _run\n",
      "    self._context.run(self._callback, *self._args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 516, in dispatch_queue\n",
      "    await self.process_one()\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 505, in process_one\n",
      "    await dispatch(*args)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 412, in dispatch_shell\n",
      "    await result\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\kernelbase.py\", line 740, in execute_request\n",
      "    reply_content = await reply_content\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\ipkernel.py\", line 422, in do_execute\n",
      "    res = shell.run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\ipykernel\\zmqshell.py\", line 546, in run_cell\n",
      "    return super().run_cell(*args, **kwargs)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3006, in run_cell\n",
      "    result = self._run_cell(\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3061, in _run_cell\n",
      "    result = runner(coro)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\async_helpers.py\", line 129, in _pseudo_sync_runner\n",
      "    coro.send(None)\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3266, in run_cell_async\n",
      "    has_raised = await self.run_ast_nodes(code_ast.body, cell_name,\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3445, in run_ast_nodes\n",
      "    if await self.run_code(code, result, async_=asy):\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\IPython\\core\\interactiveshell.py\", line 3505, in run_code\n",
      "    exec(code_obj, self.user_global_ns, self.user_ns)\n",
      "  File \"C:\\Users\\TTTeq\\AppData\\Local\\Temp\\ipykernel_18276\\203685242.py\", line 18, in <module>\n",
      "    room.post_messages(f\"{ans}\")\n",
      "  File \"c:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\chatroom.py\", line 132, in post_messages\n",
      "    logging.error(f\"An error occurred while posting the message to room {self.room_id}:\", e)\n",
      "Message: 'An error occurred while posting the message to room d4de3512-3eb5-48c0-a8f7-64c713151105:'\n",
      "Arguments: (UnicodeEncodeError('latin-1', '[(rdflib.term.Literal(\\'Vampire Assassin\\', lang=\\'en\\'),), (rdflib.term.Literal(\\'Vampires vs. Zombies\\', lang=\\'en\\'),), (rdflib.term.Literal(\\'Aag\\', lang=\\'en\\'),), (rdflib.term.Literal(\\'Joystick Nation – Generation Hip Hop\\', lang=\\'en\\'),), (rdflib.term.Literal(\\'Going Overboard\\', lang=\\'en\\'),), (rdflib.term.Literal(\"Alex l\\'ariete\", lang=\\'en\\'),), (rdflib.term.Literal(\\'House of the Dead\\', lang=\\'en\\'),), (rdflib.term.Literal(\\'Killers\\', lang=\\'en\\'),), (rdflib.term.Literal(\"Ghosts Can\\'t Do It\", lang=\\'en\\'),), (rdflib.term.Literal(\\'Snakes on a Train\\', lang=\\'en\\'),)]', 195, 196, \"Body ('–') is not valid Latin-1. Use body.encode('utf-8') if you want to send it encoded in UTF-8.\"),)\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[1;32mc:\\Users\\TTTeq\\Documents\\CodeFolder\\CP\\VCS\\ATAI\\agent\\test.ipynb Cell 5\u001b[0m line \u001b[0;36m2\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=0'>1</a>\u001b[0m \u001b[39mwhile\u001b[39;00m \u001b[39mTrue\u001b[39;00m:\n\u001b[1;32m----> <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m     rooms \u001b[39m=\u001b[39m speakeasy\u001b[39m.\u001b[39;49mget_rooms(active\u001b[39m=\u001b[39;49m\u001b[39mTrue\u001b[39;49;00m)\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m     \u001b[39mfor\u001b[39;00m room \u001b[39min\u001b[39;00m rooms:\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m         \u001b[39m# print(room)\u001b[39;00m\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=4'>5</a>\u001b[0m         \u001b[39m# Retrieve messages from this chat room.\u001b[39;00m\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=5'>6</a>\u001b[0m         \u001b[39mfor\u001b[39;00m message \u001b[39min\u001b[39;00m room\u001b[39m.\u001b[39mget_messages(only_partner\u001b[39m=\u001b[39m\u001b[39mTrue\u001b[39;00m, only_new\u001b[39m=\u001b[39m\u001b[39mTrue\u001b[39;00m):\n\u001b[0;32m      <a href='vscode-notebook-cell:/c%3A/Users/TTTeq/Documents/CodeFolder/CP/VCS/ATAI/agent/test.ipynb#W3sZmlsZQ%3D%3D?line=6'>7</a>\u001b[0m             \u001b[39m# Send a message to the corresponding chat room using the post_messages method of the room object.\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\speakeasy.py:104\u001b[0m, in \u001b[0;36mSpeakeasy.get_rooms\u001b[1;34m(self, active)\u001b[0m\n\u001b[0;32m    103\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mget_rooms\u001b[39m(\u001b[39mself\u001b[39m, active\u001b[39m=\u001b[39m\u001b[39mTrue\u001b[39;00m) \u001b[39m-\u001b[39m\u001b[39m>\u001b[39m List[Chatroom]:  \u001b[39m# includes non-active chatrooms (i.e., remaining_time == 0)\u001b[39;00m\n\u001b[1;32m--> 104\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m__update_chat_rooms()\n\u001b[0;32m    106\u001b[0m     \u001b[39mif\u001b[39;00m active:  \u001b[39m# only returns active chatrooms (i.e., remaining_time > 0)\u001b[39;00m\n\u001b[0;32m    107\u001b[0m         \u001b[39m# TODO: To avoid a lag in active detection that would make room's apis throw errors\u001b[39;00m\n\u001b[0;32m    108\u001b[0m         \u001b[39m#  (those apis only allow interactions for active rooms),\u001b[39;00m\n\u001b[0;32m    109\u001b[0m         \u001b[39m#  we can increase the threshold to self.__request_limit * 1000\u001b[39;00m\n\u001b[0;32m    110\u001b[0m         \u001b[39mreturn\u001b[39;00m [room \u001b[39mfor\u001b[39;00m room \u001b[39min\u001b[39;00m \u001b[39mlist\u001b[39m(\u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_chatrooms_dict\u001b[39m.\u001b[39mvalues()) \u001b[39mif\u001b[39;00m room\u001b[39m.\u001b[39mremaining_time \u001b[39m>\u001b[39m \u001b[39m0\u001b[39m]\n",
      "File \u001b[1;32mc:\\Users\\TTTeq\\anaconda3\\envs\\speakeasy\\lib\\site-packages\\speakeasypy-1.0.0-py3.8.egg\\speakeasypy\\src\\speakeasy.py:72\u001b[0m, in \u001b[0;36mSpeakeasy.__update_chat_rooms\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     70\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39msession_token:\n\u001b[0;32m     71\u001b[0m     current_time \u001b[39m=\u001b[39m time\u001b[39m.\u001b[39mtime()\n\u001b[1;32m---> 72\u001b[0m     elapsed_time \u001b[39m=\u001b[39m current_time \u001b[39m-\u001b[39;49m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m__last_call_for_rooms\n\u001b[0;32m     73\u001b[0m     \u001b[39mif\u001b[39;00m elapsed_time \u001b[39m>\u001b[39m\u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m__request_limit:\n\u001b[0;32m     74\u001b[0m         \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m     75\u001b[0m             \u001b[39m# Call the get_api_rooms endpoint to fetch the list of chat rooms info\u001b[39;00m\n",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "while True:\n",
    "    rooms = speakeasy.get_rooms(active=True)\n",
    "    for room in rooms:\n",
    "        # print(room)\n",
    "        # Retrieve messages from this chat room.\n",
    "        for message in room.get_messages(only_partner=True, only_new=True):\n",
    "            # Send a message to the corresponding chat room using the post_messages method of the room object.\n",
    "            query = message.message\n",
    "            # print(type(query))\n",
    "            # print(query)\n",
    "            query = str(query).strip(\" \")\n",
    "            query = str(query).strip(\"'\")\n",
    "            # print(type(query))\n",
    "            print(query)\n",
    "            ans = list(graph.query(query))\n",
    "            \n",
    "            \n",
    "            room.post_messages(f\"{ans}\")\n",
    "            # Mark the message as processed, so it will be filtered out when retrieving new messages.\n",
    "            room.mark_as_processed(message)\n",
    "            \n",
    "        # Retrieve reactions from this chat room.\n",
    "        # If only_new=True, it filters out reactions that have already been marked as processed.\n",
    "        for reaction in room.get_reactions(only_new=True):\n",
    "            # Implement your agent here #\n",
    "            room.post_messages(f\"Received your reaction: '{reaction.type}' \")\n",
    "            room.mark_as_processed(reaction)\n",
    "            \n",
    "            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[(rdflib.term.Literal('Forrest Gump', lang='en'),)]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''PREFIX ddis: <http://ddis.ch/atai/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX schema: <http://schema.org/> SELECT ?lbl WHERE {?movie wdt:P31 wd:Q11424 . ?movie ddis:rating ?rating .     ?movie rdfs:label ?lbl .  }  ORDER BY DESC(?rating)   LIMIT 1 '''\n",
    "\n",
    "list(graph.query(query))\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "speakeasy",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
